Repository: MaxGrishenko/MaxCB
Catalog: Web/Resources/Models/RecipeViewModel.*.resx
Languages: de, ru

# categories_name
source: Food category:
de: Lebensmittelkategorie:
ru: Категория блюда:

# cook_time_name
source: Preparation:
de: Vorbereitung:
ru: Приготовления:

# description_length
source: Description length must be between 10 and 100 characters
de: Die Beschreibungslänge muss zwischen 10 und 100 Zeichen liegen
ru: Длина описания должна быть от 10 до 100 символов

# description_name
source: Short description:
de: Kurzbeschreibung:
ru: Краткое описание:

# description_promt
source: A brief description of your recipe
de: Eine kurze Beschreibung Ihres Rezepts
ru: Краткое описание вашего рецепта

# description_regular
source: Incorrect input * Only Latin, Cyrillic letters and symbols (.,?! :-) *
de: Ungültige Eingabe * Nur lateinische, kyrillische Buchstaben und Symbole (.,?! :-) *
ru: Некорректный ввод *Только латинские, кириллические буквы и символы (.,? !:-) *

# description_required
source: A brief description of the recipe is missing
de: Eine kurze Beschreibung des Rezepts fehlt
ru: Не указано краткое описание рецепта

# difficulties_name
source: Complexity of preparation:
de: Komplexität der Zubereitung:
ru: Сложность приготовления:

# image_path_name
source: Upload a photo of your dish!
de: Laden Sie ein Foto Ihres Gerichts hoch!
ru: Загрузите фото вашего блюда!

# ingredients_length
source: Ingredient description must be between 3 and 300 characters
de: Die Zutatenbeschreibung muss zwischen 3 und 300 Zeichen lang sein
ru: Описание ингредиента должна быть от 3 до 300 символов

# ingredients_name
source: Ingredients Used:
de: Verwendete Zutaten:
ru: Используемые ингредиенты:

# ingredients_promt
source: Enter the first ingredient!
de: Geben Sie die erste Zutat ein!
ru: Введите первый ингредиент!

# ingredients_regular
source: Incorrect entry * Only Latin, Cyrillic letters, numbers and symbols (.,?! :-) *
de: Falsche Eingabe * Nur lateinische, kyrillische Buchstaben, Zahlen und Symbole (.,?! :-) *
ru: Некорректный ввод * Только латинские, кириллические буквы, цифры и символы (.,? !:-) *

# ingredients_required
source: One or more ingredients are missing!
de: Eine oder mehrere Zutaten fehlen!
ru: Один или несколько ингредиентов не указаны!

# marinade_name
source: Marinade:
ru: Мариновки:

# methods_length
source: Step description must be between 10 and 300 characters
de: Die Schrittbeschreibung muss zwischen 10 und 300 Zeichen lang sein
ru: Описание шага должно быть от 10 до 300 символов

# methods_name
source: Cooking steps:
de: Kochschritte:
ru: Шаги приготовления:

# methods_promt
source: Enter the first step of the application!
de: Geben Sie den ersten Schritt der Anwendung ein!
ru: Введите первый шаг притовления!

# methods_regular
source: Incorrect entry * Only Latin, Cyrillic letters, numbers and symbols (.,?! :-) *
de: Falsche Eingabe * Nur lateinische, kyrillische Buchstaben, Zahlen und Symbole (.,?! :-) *
ru: Некорректный ввод * Только латинские, кириллические буквы, цифры и символы (.,? !:-) *

# methods_required
source: One or more steps are missing!
de: Ein oder mehrere Schritte fehlen!
ru: Один или несколько шагов не указано!

# prep_time_name
source: Preparations:
de: Vorbereitungen:
ru: Подготовки:

# tips_length
source: The description of the tooltip must be between 3 and 300 characters
de: Die Beschreibung des Tooltips muss zwischen 3 und 300 Zeichen enthalten
ru: Описание подсказки должно быть от 3 до 300 символов

# tips_name
source: Hints and tips:
de: Hinweise und Tipps:
ru: Подсказки и советы:

# tips_promt
source: Share a cooking trick!
de: Teilen Sie einen Kochtrick!
ru: Поделитесь какой-нибудь хитростью в приготовлении!

# tips_regular
source: Incorrect entry * Only Latin, Cyrillic letters, numbers and symbols (.,?! :-) *
de: Falsche Eingabe * Nur lateinische, kyrillische Buchstaben, Zahlen und Symbole (.,?! :-) *
ru: Некорректный ввод * Только латинские, кириллические буквы, цифры и символы (.,? !:-) *

# title_length
source: The name must be between 3 and 30 characters long
de: Der Name muss zwischen 3 und 30 Zeichen lang sein
ru: Длина названия должна быть от 3 до 30 символов

# title_name
source: Recipe name:
de: Rezeptname:
ru: Название рецепта:

# title_promt
source: Enter the name of your recipe
de: Geben Sie den Namen Ihres Rezepts ein
ru: Введите название вашего рецепта

# title_regular
source: Incorrect input * Only Latin and Cyrillic letters *
de: Falsche Eingabe * Nur lateinische und kyrillische Buchstaben *
ru: Некорректный ввод *Только латинские и кириллические буквы*

# title_required
source: No recipe name specified
de: Kein Rezeptname angegeben
ru: Не указано название рецепта
